In [1]:
import numpy as np
import pandas as pd

df = pd.read_csv('./data/titanic.csv')
# df_t = pd.read_csv('https://dat-data.s3.amazonaws.com/taxi.csv')
df_t = pd.read_csv('./data/taxi.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
df_t.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1710670 entries, 0 to 1710669
Data columns (total 8 columns):
 #   Column        Dtype
---  ------        -----
 0   TRIP_ID       int64
 1   CALL_TYPE     object
 2   ORIGIN_CALL   float64
 3   ORIGIN_STAND  float64
 4   TAXI_ID       int64
 5   TIMESTAMP     int64
 6   DAY_TYPE      object
 7   MISSING_DATA  bool
dtypes: bool(1), float64(2), int64(3), object(2)
memory usage: 93.0+ MB

In [22]:
col_names = df.columns.to_list()

In [23]:
col_names

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [24]:
col_dtypes = df.dtypes.to_list()
col_dtypes

[dtype('int64'),
 dtype('int64'),
 dtype('int64'),
 dtype('O'),
 dtype('O'),
 dtype('float64'),
 dtype('int64'),
 dtype('int64'),
 dtype('O'),
 dtype('float64'),
 dtype('O'),
 dtype('O')]

In [25]:
df['Pclass'].dtype

dtype('int64')

In [26]:
str(df['Pclass'].dtype)

'int64'

In [28]:
col_dict = {}
for c in col_names:
    col_dict[c] = {'dtype':str(df[c].dtype)}

In [16]:
dict_test = {'a':{'b':'one','c':'two'}}

In [20]:
dict_test['a']['c']

'two'

In [29]:
col_dict

{'PassengerId': {'dtype': 'int64'},
 'Survived': {'dtype': 'int64'},
 'Pclass': {'dtype': 'int64'},
 'Name': {'dtype': 'object'},
 'Sex': {'dtype': 'object'},
 'Age': {'dtype': 'float64'},
 'SibSp': {'dtype': 'int64'},
 'Parch': {'dtype': 'int64'},
 'Ticket': {'dtype': 'object'},
 'Fare': {'dtype': 'float64'},
 'Cabin': {'dtype': 'object'},
 'Embarked': {'dtype': 'object'}}

In [33]:
col_dict['Age'].update({'a':'one'})

In [65]:
col_dict['Age']

{'dtype': 'float64', 'a': 'one', 'b': 345}

In [64]:
col_dict['Age']['b']=345

In [35]:
a = [[1,2,3],[3,6,7]]

In [37]:
a[0][1]

2

In [41]:
df.index.size

891

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [43]:
col_stats = []
for c in col_names:
    col_stats.append([c])

In [47]:
col_stats[0][0]

'PassengerId'

In [51]:
df['Cabin'].isnull().sum()

687

In [53]:
df['Cabin'].dtype=='O'

True

In [63]:
for (c,j) in enumerate(col_names):
    print(str(c) + ' ' + j)

0 PassengerId
1 Survived
2 Pclass
3 Name
4 Sex
5 Age
6 SibSp
7 Parch
8 Ticket
9 Fare
10 Cabin
11 Embarked

In [59]:
for i in enumerate(col_names):
    print(i)

(0, 'PassengerId')
(1, 'Survived')
(2, 'Pclass')
(3, 'Name')
(4, 'Sex')
(5, 'Age')
(6, 'SibSp')
(7, 'Parch')
(8, 'Ticket')
(9, 'Fare')
(10, 'Cabin')
(11, 'Embarked')

In [70]:
df['SibSp'].mean()

0.5230078563411896

In [77]:
a = np.float64(1234)

In [78]:
type(a)

numpy.float64

In [3]:
df_t['TRIP_ID'].sum()/df_t.index.size

-2810564610072.737

In [4]:
df_t.isnull().sum()

TRIP_ID               0
CALL_TYPE             0
ORIGIN_CALL     1345900
ORIGIN_STAND     904091
TAXI_ID               0
TIMESTAMP             0
DAY_TYPE              0
MISSING_DATA          0
dtype: int64

In [5]:
df_t.describe()

            TRIP_ID    ORIGIN_CALL   ORIGIN_STAND       TAXI_ID     TIMESTAMP
count  1.710670e+06  364770.000000  806579.000000  1.710670e+06  1.710670e+06
mean   1.388622e+18   24490.363018      30.272381  2.000035e+07  1.388622e+09
std    9.180944e+15   19624.290043      17.747840  2.112405e+02  9.180944e+06
min    1.372637e+18    2001.000000       1.000000  2.000000e+07  1.372637e+09
25%    1.380731e+18    6593.000000      15.000000  2.000017e+07  1.380731e+09
50%    1.388493e+18   18755.000000      27.000000  2.000034e+07  1.388493e+09
75%    1.396750e+18   40808.000000      49.000000  2.000052e+07  1.396750e+09
max    1.404173e+18   63884.000000      63.000000  2.000098e+07  1.404173e+09

In [7]:
np.finfo(np.float64)

finfo(resolution=1e-15, min=-1.7976931348623157e+308, max=1.7976931348623157e+308, dtype=float64)

In [8]:
df_t['TRIP_ID']

0          1372636858620000589
1          1372637303620000596
2          1372636951620000320
3          1372636854620000520
4          1372637091620000337
                  ...
1710665    1404171463620000698
1710666    1404171367620000670
1710667    1388745716620000264
1710668    1404141826620000248
1710669    1404157147620000079
Name: TRIP_ID, Length: 1710670, dtype: int64

In [11]:
df_t['TRIP_ID'].astype(np.float64).sum()

2.3754746601433843e+24

In [12]:
df_t

,TRIP_ID,CALL_TYPE,ORIGIN_CALL,ORIGIN_STAND,TAXI_ID,TIMESTAMP,DAY_TYPE,MISSING_DATA
0,1372636858620000589,C,NaN,NaN,20000589,1372636858,A,False
1,1372637303620000596,B,NaN,7.0,20000596,1372637303,A,False
2,1372636951620000320,C,NaN,NaN,20000320,1372636951,A,False
3,1372636854620000520,C,NaN,NaN,20000520,1372636854,A,False
4,1372637091620000337,C,NaN,NaN,20000337,1372637091,A,False
...,...,...,...,...,...,...,...,...
1710665,1404171463620000698,C,NaN,NaN,20000698,1404171463,A,False
1710666,1404171367620000670,C,NaN,NaN,20000670,1404171367,A,False
1710667,1388745716620000264,C,NaN,NaN,20000264,1388745716,A,False
1710668,1404141826620000248,B,NaN,12.0,20000248,1404141826,A,False
1710669,1404157147620000079,B,NaN,34.0,20000079,1404157147,A,False

In [57]:
df_a = df_t.copy()

In [58]:
mv = {'ORIGIN_CALL':24490.363017792035,
      'ORIGIN_STAND':30.272381254657013,
    }

In [59]:
mv

{'ORIGIN_CALL': 24490.363017792035, 'ORIGIN_STAND': 30.272381254657013}

In [60]:
mv['ORIGIN_CALL']

24490.363017792035

In [61]:
(df_a['ORIGIN_CALL'].isnull() == True).sum()

1345900

In [62]:
df_a['ORIGIN_CALL'][(df_a['ORIGIN_CALL'].isnull() == True)]

0         NaN
1         NaN
2         NaN
3         NaN
4         NaN
           ..
1710665   NaN
1710666   NaN
1710667   NaN
1710668   NaN
1710669   NaN
Name: ORIGIN_CALL, Length: 1345900, dtype: float64

In [63]:
# df['DataFrame Column'] = df['DataFrame Column'].replace(np.nan, 0)

for i in mv:
    df_a[i] = df_a[i].replace(np.nan,mv[i])

In [64]:
df_a

,TRIP_ID,CALL_TYPE,ORIGIN_CALL,ORIGIN_STAND,TAXI_ID,TIMESTAMP,DAY_TYPE,MISSING_DATA
0,1372636858620000589,C,24490.363018,30.272381,20000589,1372636858,A,False
1,1372637303620000596,B,24490.363018,7.000000,20000596,1372637303,A,False
2,1372636951620000320,C,24490.363018,30.272381,20000320,1372636951,A,False
3,1372636854620000520,C,24490.363018,30.272381,20000520,1372636854,A,False
4,1372637091620000337,C,24490.363018,30.272381,20000337,1372637091,A,False
...,...,...,...,...,...,...,...,...
1710665,1404171463620000698,C,24490.363018,30.272381,20000698,1404171463,A,False
1710666,1404171367620000670,C,24490.363018,30.272381,20000670,1404171367,A,False
1710667,1388745716620000264,C,24490.363018,30.272381,20000264,1388745716,A,False
1710668,1404141826620000248,B,24490.363018,12.000000,20000248,1404141826,A,False
1710669,1404157147620000079,B,24490.363018,34.000000,20000079,1404157147,A,False